INSERT INTO theme (name, description, image) VALUES
    ('은하수', '은하수 테마방입니다.', 'http.jpg'),
    ('지구', '지구 테마방입니다.', 'http.jpg'),
    ('수성', '수성 테마방입니다.', 'http.jpg'),
    ('금성', '금성 테마방입니다.', 'http.jpg'),
    ('화성', '화성 테마방입니다.', 'http.jpg'),
    ('목성', '목성 테마방입니다.', 'http.jpg'),
    ('토성', '토성 테마방입니다.', 'http.jpg'),
    ('보이저', '보이저 테마방입니다.', 'http.jpg'),
    ('아폴로', '아폴로 테마방입니다.', 'http.jpg'),
    ('허블', '허블 테마방입니다.', 'http.jpg'),
    ('안드로메다', '안드로메다 테마방입니다.', 'http.jpg');

INSERT INTO reservation_time (start_at) VALUES
    ('10:00'),
    ('11:00'),
    ('12:00'),
    ('13:00'),
    ('14:00'),
    ('15:00'),
    ('16:00'),
    ('17:00'),
    ('18:00'),
    ('19:00'),
    ('20:00');

INSERT INTO reservation (name, date, time_id, theme_id) VALUES
    ('워넬', '2026-05-05', 1, 2),
    ('도우너', '2026-05-05', 2, 2),
    ('로치', '2026-05-05', 1, 1),
    ('로치', '2026-05-05', 1, 3),
    ('로치', '2026-05-05', 1, 4),
    ('로치', '2026-05-05', 1, 5),
    ('로치', '2026-05-05', 1, 6),
    ('로치', '2026-05-05', 1, 7),
    ('로치', '2026-05-05', 1, 8),
    ('로치', '2026-05-05', 1, 9),
    ('로치', '2026-05-05', 1, 10),
    ('로치', '2026-05-05', 1, 11),
    ('로치', '2026-05-05', 4, 1),
    ('로치', '2026-05-05', 4, 2),
    ('로치', '2026-05-05', 4, 3);