MERGE INTO reservation_time(start_at) KEY (start_at) VALUES
    ('10:00'), ('10:10'), ('10:20'), ('10:30'), ('10:40'), ('10:50'),
    ('11:00'), ('11:10'), ('11:20'), ('11:30'), ('11:40'), ('11:50'),
    ('12:00'), ('12:10'), ('12:20'), ('12:30'), ('12:40'), ('12:50'),
    ('13:00'), ('13:10'), ('13:20'), ('13:30'), ('13:40'), ('13:50'),
    ('14:00'), ('14:10'), ('14:20'), ('14:30'), ('14:40'), ('14:50'),
    ('15:00'), ('15:10'), ('15:20'), ('15:30'), ('15:40'), ('15:50'),
    ('16:00'), ('16:10'), ('16:20'), ('16:30'), ('16:40'), ('16:50'),
    ('17:00'), ('17:10'), ('17:20'), ('17:30'), ('17:40'), ('17:50'),
    ('18:00'), ('18:10'), ('18:20'), ('18:30'), ('18:40'), ('18:50'),
    ('19:00'), ('19:10'), ('19:20'), ('19:30'), ('19:40'), ('19:50'),
    ('20:00'), ('20:10'), ('20:20'), ('20:30');

MERGE INTO theme(name, description, thumbnail) KEY (name, description, thumbnail) VALUES
    ('시간조작자 연구소', '반복되는 1시간, 탈출 못하면 다시 시작된다.', '/images/themes/1.png'),
    ('사라진 개발자', '흔적만 남긴 채 사라진 개발자의 마지막 로그를 추적', '/images/themes/2.png'),
    ('404호의 비밀', '존재하지 않는 방, 들어간 사람은 돌아오지 않는다.', '/images/themes/3.png'),
    ('녹화된 마지막 하루', '누군가의 마지막 하루를 되돌려 탈출해야 한다.', '/images/themes/4.png'),
    ('VIP 전용 금고', '제한 시간 내 금고를 열지 못하면 시스템이 초기화된다.', '/images/themes/5.png');