insert into member (email, password, name, role)
values
    ('qwer@q.com', 'qwer', 'qwer', 'USER'),
    ('qwer2@q.com', 'qwer2', 'qwer2', 'USER'),
    ('qwer3@q.com', 'qwer3', 'qwer3', 'USER'),
    ('admin@admin.com', 'admin', 'admin', 'ADMIN');


insert into theme (name, description, thumbnail)
values
    ('theme1','description','thumbnail'),
    ('theme2','description','thumbnail'),
    ('theme3','description','thumbnail'),
    ('theme4','description','thumbnail'),
    ('theme5','description','thumbnail'),
    ('theme6','description','thumbnail'),
    ('theme7','description','thumbnail'),
    ('theme8','description','thumbnail'),
    ('theme9','description','thumbnail'),
    ('theme10','description','thumbnail'),
    ('theme11','description','thumbnail'),
    ('theme12','description','thumbnail'),
    ('theme13','description','thumbnail')
;

-- 예약 시간
insert into reservation_time (start_at)
values
    ('10:00'),
    ('10:10'),
    ('10:20'),
    ('10:30'),
    ('10:40'),
    ('10:50'),
    ('11:00'),
    ('11:10'),
    ('11:20'),
    ('11:30'),
    ('11:40'),
    ('11:50'),
    ('12:00'),
    ('12:10'),
    ('12:20'),
    ('12:30'),
    ('12:40'),
    ('12:50');

-- 예약 개수 차등두기
insert into reservation (name, theme_id, date, time_id)
values
    -- theme_id = 1 (10개 예약)
    ('예약자1', 1, '2025-05-08', 1),
    ('예약자2', 1, '2025-05-08', 2),
    ('예약자3', 1, '2025-05-08', 3),
    ('예약자4', 1, '2025-05-08', 4),
    ('예약자5', 1, '2025-05-08', 5),
    ('예약자6', 1, '2025-05-08', 6),
    ('예약자7', 1, '2025-05-08', 7),
    ('예약자8', 1, '2025-05-08', 8),
    ('예약자9', 1, '2025-05-08', 9),
    ('예약자10', 1,'2025-05-08', 10),

    -- theme_id = 2 (9개 예약)
    ('예약자11', 2, '2025-05-07', 1),
    ('예약자12', 2, '2025-05-07', 2),
    ('예약자13', 2, '2025-05-07', 3),
    ('예약자14', 2, '2025-05-07', 4),
    ('예약자15', 2, '2025-05-07', 5),
    ('예약자16', 2, '2025-05-07', 6),
    ('예약자17', 2, '2025-05-07', 7),
    ('예약자18', 2, '2025-05-07', 8),
    ('예약자19', 2, '2025-05-07', 9),

    -- theme_id = 3 (8개 예약)
    ('예약자20', 3, '2025-05-06', 1),
    ('예약자21', 3, '2025-05-06', 2),
    ('예약자22', 3, '2025-05-06', 3),
    ('예약자23', 3, '2025-05-06', 4),
    ('예약자24', 3, '2025-05-06', 5),
    ('예약자25', 3, '2025-05-06', 6),
    ('예약자26', 3, '2025-05-06', 7),
    ('예약자27', 3, '2025-05-06', 8),

    -- theme_id = 4 (7개 예약)
    ('예약자28', 4, '2025-05-05', 3),
    ('예약자29', 4, '2025-05-05', 4),
    ('예약자30', 4, '2025-05-05', 5),
    ('예약자31', 4, '2025-05-05', 6),
    ('예약자32', 4, '2025-05-05', 7),
    ('예약자33', 4, '2025-05-05', 8),
    ('예약자34', 4, '2025-05-05', 9),

    -- theme_id = 5 (6개 예약)
    ('예약자35', 5, '2025-05-04', 5),
    ('예약자36', 5, '2025-05-04', 6),
    ('예약자37', 5, '2025-05-04', 7),
    ('예약자38', 5, '2025-05-04', 8),
    ('예약자39', 5, '2025-05-04', 9),
    ('예약자40', 5, '2025-05-04', 10),

    -- theme_id = 6 (5개 예약)
    ('예약자41', 6, '2025-05-03', 1),
    ('예약자42', 6, '2025-05-03', 2),
    ('예약자43', 6, '2025-05-03', 3),
    ('예약자44', 6, '2025-05-03', 4),
    ('예약자45', 6, '2025-05-03', 5),

    -- theme_id = 7 (4개 예약)
    ('예약자46', 7, '2025-05-02', 6),
    ('예약자47', 7, '2025-05-02', 7),
    ('예약자48', 7, '2025-05-02', 8),
    ('예약자49', 7, '2025-05-02', 9),

    -- theme_id = 8 (3개 예약)
    ('예약자50', 8, '2025-05-01', 1),
    ('예약자51', 8, '2025-05-01', 2),
    ('예약자52', 8, '2025-05-01', 3),

    -- theme_id = 9 (2개 예약)
    ('예약자53', 9, '2025-04-30', 4),
    ('예약자54', 9, '2025-04-30', 5),

    -- theme_id = 10 (1개 예약)
    ('예약자55', 10, '2025-04-30', 8);
