INSERT INTO reservation_time (start_at)
VALUES ('10:00'),
       ('11:00'),
       ('13:00'),
       ('14:00'),
       ('15:00'),
       ('16:00'),
       ('17:00'),
       ('18:00'),
       ('19:00'),
       ('20:00'),
       ('21:00');

INSERT INTO theme (name, description, imgUrl)
VALUES ('이든의 공포 하우스', '이든이 귀신으로 나오는 공포 테마', 'https://images.example.com/themes/horror-house.jpg'),
       ('정콩이의 방탈출', '정콩이가 지키는 미스터리 방탈출', 'https://images.example.com/themes/jungkong-room.jpg'),
       ('우주 정거장 탈출', '고장 난 우주 정거장에서 귀환하는 SF 테마', 'https://images.example.com/themes/space-station.jpg');

INSERT INTO reservation (name, date, time_id, theme_id)
VALUES ('이든', '2026-04-29', 1, 1),
       ('로이', '2026-04-30', 1, 1),
       ('브라운', '2026-05-01', 1, 1),
       ('코니', '2026-05-02', 1, 1),
       ('샐리', '2026-05-03', 1, 1),
       ('제임스', '2026-05-04', 1, 1),
       ('포비', '2026-05-05', 1, 1),
       ('리버', '2026-05-06', 1, 1),
       ('글렌', '2026-05-07', 1, 1),
       ('도비', '2026-05-01', 2, 1),
       ('라라', '2026-05-02', 2, 1),
       ('모디', '2026-05-03', 2, 1),

       ('오리', '2026-04-29', 2, 2),
       ('루루', '2026-05-01', 3, 2),
       ('나나', '2026-05-02', 3, 2),
       ('토토', '2026-05-03', 3, 2),
       ('비비', '2026-05-04', 3, 2),
       ('키키', '2026-05-05', 3, 2),
       ('하루', '2026-05-06', 3, 2),
       ('두리', '2026-05-07', 3, 2),

       ('세리', '2026-05-01', 4, 3),
       ('네오', '2026-05-02', 4, 3),
       ('민트', '2026-05-03', 4, 3),
       ('초코', '2026-05-04', 4, 3),
       ('쿠키', '2026-05-05', 4, 3),
       ('피치', '2026-05-06', 4, 3),

       ('브라운', '2026-05-08', 1, 1),
       ('코니', '2026-05-08', 1, 2),
       ('샐리', '2026-05-08', 2, 1);
