INSERT INTO reservation_time (start_at)
VALUES ('10:00'),
       ('11:00');

INSERT INTO theme (name, description, thumbnail)
VALUES ('테마1', '테마 1입니다', '썸네일1'),
       ('테마2', '테마 2입니다', '썸네일2'),
       ('테마3', '테마 3입니다', '썸네일3'),
       ('테마4', '테마 4입니다', '썸네일4'),
       ('테마5', '테마 5입니다', '썸네일5'),
       ('테마6', '테마 6입니다', '썸네일6'),
       ('테마7', '테마 7입니다', '썸네일7'),
       ('테마8', '테마 8입니다', '썸네일8'),
       ('테마9', '테마 9입니다', '썸네일9'),
       ('테마10', '테마 10입니다', '썸네일10'),
       ('테마11', '테마 11입니다', '썸네일11');

INSERT INTO reservation (name, theme_id, date, time_id)
VALUES ('브라운', 1, '2025-04-29', 1),
       ('솔라', 1, '2025-04-28', 2),
       ('브리', 1, '2025-04-27', 1),
       ('브리1', 1, '2025-04-26', 1),
       ('브리2', 1, '2025-04-25', 1),
       ('브리3', 2, '2025-04-24', 1),
       ('브리4', 2, '2025-04-23', 1),
       ('브리5', 2, '2025-04-23', 1),
       ('브리6', 2, '2025-04-23', 1),
       ('브리7', 8, '2025-04-23', 1),
       ('브리8', 8, '2025-04-23', 1),
       ('브리9', 8, '2025-04-23', 1),
       ('브리10', 9, '2025-04-23', 1),
       ('브리11', 11, '2025-04-23', 1),
       ('브리12', 11, '2025-04-23', 1);
