INSERT INTO reservation_time(id, start_at)
VALUES (1, '11:10'),
       (2, '12:10'),
       (3, '13:10'),
       (4, '14:10'),
       (5, '15:10');

INSERT INTO theme(id, name, description, thumbnail)
VALUES (1, '테마1', '재밌는설명', '썸네일'),
       (2, '테마2', '설명22', '썸네일2'),
       (3, '테마3', '설명33', '썸네일3');

INSERT INTO reservation(id, name, reservation_date, time_id, theme_id)
VALUES (1, '프린', '2024-05-01', 1, 1),
       (2, '프린', '2024-05-01', 2, 1),
       (3, '프린', '2024-05-01', 3, 1),
       (4, '프린', '2024-05-01', 4, 1),
       (5, '레모네', '2024-05-01', 5, 1),
       (6, '레모네', '2024-05-01', 1, 2),
       (7, '레모네', '2024-05-01', 2, 2),
       (8, '레모네', '2024-05-01', 1, 3),
       (9, '오리', '2024-05-01', 2, 3),
       (10, '오리', '2024-05-01', 3, 3);
